```
SETUP: tests/aws_cloudfront_origin_request_policy []

PRETEST: tests/aws_cloudfront_origin_request_policy

TEST: tests/aws_cloudfront_origin_request_policy
Running terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_origin_request_policy.named_test_resource will be created
  + resource "aws_cloudfront_origin_request_policy" "named_test_resource" {
      + comment = "turbottest44793"
      + etag    = (known after apply)
      + id      = (known after apply)
      + name    = "turbottest44793"

      + cookies_config {
          + cookie_behavior = "whitelist"

          + cookies {
              + items = [
                  + "example",
                ]
            }
        }

      + headers_config {
          + header_behavior = "whitelist"

          + headers {
              + items = [
                  + "example",
                ]
            }
        }

      + query_strings_config {
          + query_string_behavior = "whitelist"

          + query_strings {
              + items = [
                  + "example",
                ]
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + account_id    = "986325076436"
  + aws_partition = "aws"
  + etag          = (known after apply)
  + resource_aka  = (known after apply)
  + resource_id   = (known after apply)
  + resource_name = "turbottest44793"
aws_cloudfront_origin_request_policy.named_test_resource: Creating...
aws_cloudfront_origin_request_policy.named_test_resource: Creation complete after 3s [id=334c9674-a0cc-4ee4-b9c9-eb8639cd7f34]

Warning: Deprecated Resource

  with data.null_data_source.resource,
  on variables.tf line 43, in data "null_data_source" "resource":
  43: data "null_data_source" "resource" {

The null_data_source was historically used to construct intermediate values
to re-use elsewhere in configuration, the same can now be achieved using
locals

(and one more similar warning elsewhere)

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

account_id = "986325076436"
aws_partition = "aws"
etag = "E23ZP02F085DFQ"
resource_aka = "arn:aws:cloudfront::986325076436:origin-request-policy/334c9674-a0cc-4ee4-b9c9-eb8639cd7f34"
resource_id = "334c9674-a0cc-4ee4-b9c9-eb8639cd7f34"
resource_name = "turbottest44793"

Running SQL query: test-get-query.sql
[
  {
    "account_id": "986325076436",
    "comment": "turbottest44793",
    "etag": "E23ZP02F085DFQ",
    "id": "334c9674-a0cc-4ee4-b9c9-eb8639cd7f34",
    "title": "turbottest44793"
  }
]
✔ PASSED

Running SQL query: test-list-query.sql
[
  {
    "account_id": "986325076436",
    "comment": "turbottest44793",
    "etag": "E23ZP02F085DFQ",
    "id": "334c9674-a0cc-4ee4-b9c9-eb8639cd7f34",
    "name": "turbottest44793",
    "title": "turbottest44793"
  }
]
✔ PASSED

Running SQL query: test-notfound-query.sql
null
✔ PASSED

Running SQL query: test-turbot-query.sql
[
  {
    "account_id": "986325076436",
    "akas": [
      "arn:aws:cloudfront::986325076436:origin-request-policy/334c9674-a0cc-4ee4-b9c9-eb8639cd7f34"
    ],
    "title": "turbottest44793"
  }
]
✔ PASSED

POSTTEST: tests/aws_cloudfront_origin_request_policy

TEARDOWN: tests/aws_cloudfront_origin_request_policy

SUMMARY:

1/1 passed.
```